#include "bbs.h"

extern void insert_char(char);
extern int currpnt;

/* ----------------------------------------------------- */
/* Dopin : 文章輸入工具 原作者 weichung                  */
/* ----------------------------------------------------- */

#ifdef INPUT_TOOLS           /* 99/10/27 weichung 符號輸入工具 */
int input_tools() {          /* 02/08/13 Dopin    亞站適用版本 (For DSO) */
  char msg1[] = {"1.括符方塊  2.線條箭頭  3.數字標點？ (N/Down:下一頁) [Q] "};
  char msg2[] = {"4.圖案數字  5.希臘字母  6.注音符號？ (P/Up  :上一頁) [Q] "};
  char *ansi1[5][10]=
  {
    {"▁", "▂", "▃", "▄", "▅", "▆", "▇", "█", "◢", "◣"},
    {"▏", "▎", "▍", "▌", "▋", "▊", "▉", "◥", "◤", "（"},
    {"）", "｛", "｝", "〔", "〕", "【", "】", "《", "》", "〈"},
    {"〉", "「", "」", "『", "』", "︻", "︼", "︽", "︾", "︵"},
    {"︶", "︷", "︸", "︹", "︺", "﹁", "﹂", "﹃", "﹄", ""}
  };

  char *ansi2[5][10]=
  {
    {"┌", "┬", "┐", "├", "┼", "┤", "└", "┴", "┘", "─"},
    {"│", "╭", "╮", "╰", "╯", "▔", "▕", "╱", "╲", "╳"},
    {"═", "╞", "╪", "╡", "∕", "﹨", "↑", "↓", "←", "→"},
    {"↖", "↗", "↙", "↘", "∥", "∣", "﹉", "﹊", "﹍", "﹎"},
    {"﹋", "︴", "﹏\", "–", "", "", "", "", "", ""}
  };

  char *ansi3[5][10]=
  {
    {"，", "、", "。", "．", "‧", "；", "：", "？", "！", "…"},
    {"‘", "’", "“", "”", "〝", "〞", "＃", "＆", "＊", "※"},
    {"§", "﹡", "＋", "－", "×", "÷", "±", "＜", "＞", "＝"},
    {"≦", "≧", "≠", "∞", "≒", "≡", "～", "∫", "∮", "♀"},
    {"♂", "∵", "∴", "∩", "∪", "⊥", "∠", "∟", "⊿", ""}
  };

  char *ansi4[5][10]=
  {
    {"○", "●", "△", "▲", "◎", "☆", "◇", "◆", "□", "■"},
    {"▽", "▼", "㊣", "⊕", "⊙", "０", "１", "２", "３", "４"},
    {"５", "６", "７", "８", "９", "Ⅰ", "Ⅱ", "Ⅲ", "Ⅳ", "Ⅴ"},
    {"Ⅵ", "Ⅶ", "Ⅷ", "Ⅸ", "Ⅹ", "〡", "〢", "〣", "〤", "〥"},
    {"〦", "〧", "〨", "〩", "十", "卄", "卅", "", "", ""}
  };

  char *ansi5[5][10]=
  {
    {"Α", "Β", "Γ", "Δ", "Ε", "Ζ", "Η", "Θ", "Ι", "Κ"},
    {"Λ", "Μ", "Ν", "Ξ", "Ο", "Π", "Ρ", "Σ", "Τ", "Υ"},
    {"Φ", "Χ", "Ψ", "Ω", "α\", "β", "γ", "δ", "ε", "ζ"},
    {"η", "θ", "ι", "κ", "λ", "μ", "ν", "ξ", "ο", "π"},
    {"ρ", "σ", "τ", "υ", "φ", "χ", "ψ", "ω", "", ""}
  };

  char *ansi6[5][10]=
  {
    {"ㄅ", "ㄆ", "ㄇ", "ㄈ", "ㄉ", "ㄊ", "ㄋ", "ㄌ", "ㄍ", "ㄎ"},
    {"ㄏ", "ㄐ", "ㄑ", "ㄒ", "ㄓ", "ㄔ", "ㄕ", "ㄖ", "ㄗ", "ㄘ"},
    {"ㄙ", "ㄚ", "ㄛ", "ㄜ", "ㄝ", "ㄞ", "ㄟ", "ㄠ", "ㄡ", "ㄢ"},
    {"ㄣ", "ㄤ", "ㄥ", "ㄦ", "ㄧ", "ㄨ", "ㄩ", "˙", "ˊ", "ˇ"},
    {"ˋ", "", "", "", "", "", "", "", "", ""}
  };

  char buf[128] = "內碼輸入工具:", tmp[5];
  char *show[5][10];
  int ch, i, page;

  ch = 'p';
  do {
    strcpy(buf + 13, (ch == 'p' || ch == KEY_UP) ? msg1 : msg2);
    out2line(1, b_lines, buf);
    ch = igetkey();
  } while(ch == 'p' || ch == 'n' || ch == KEY_UP || ch == KEY_DOWN);

 if(ch == Ctrl('I')) {
    do {
       insert_char(' ');
    } while (currpnt & 0x7);

    return ch;
 }

 if(ch < '1' || ch > '6') return 0;

 switch(ch) {
   case '1':
     memcpy(show, ansi1, sizeof(show));
     break;
   case '2':
     memcpy(show, ansi2, sizeof(show));
     break;
   case '3':
     memcpy(show, ansi3, sizeof(show));
     break;
   case '4':
     memcpy(show, ansi4, sizeof(show));
     break;
    case '5':
      memcpy(show, ansi5, sizeof(show));
      break;
    case '6':
      memcpy(show, ansi6, sizeof(show));
      break;
  }

  page = 0;
  while(1) {
    buf[0] = '\0';

    for(i = 0; i < 10; i++) {
      sprintf(tmp, "%d%s%s ", i, ".", show[page][i]);
      strcat(buf, tmp);
    }
    strcat(buf, "(P/Up:上  N/Down:下) [Q] \0");
    out2line(1, b_lines, buf);
    ch = igetkey();

    if(ch == 'p' || ch == KEY_UP) {
      if(page) page -= 1;
    }
    else if(ch == 'n' || ch == KEY_DOWN) {
      if(page != 4)
        page += 1;
    }
    else if(ch < '0' || ch > '9') {
      buf[0] = '\0';
      break;
    }
    else
      insert_string(show[page][ch - '0']);

    buf[0] = '\0';
  }
  return 0;
}
#endif
